import 'package:flutter_icons/flutter_icons.dart';
import 'package:flutter/material.dart';
import 'package:assets_audio_player/assets_audio_player.dart';
import 'package:game/main.dart';
import 'package:game/test.dart';

class levels extends StatefulWidget {
  int x = 0;
  int score = 0;
  levels(int a, int b) {
    this.x = a;
    this.score = b;
  }
  @override
  _levelsState createState() => _levelsState(x, score);
}

class _levelsState extends State<levels> {
  static int mylevel = 0;
  static int myscore = 0;

  _levelsState(int a, int score) {
    if (mylevel < a) {
      mylevel = a;
      AssetsAudioPlayer.newPlayer().open(
        Audio("assets2/sound/367190__iceofdoom__oh.wav"),
        showNotification: true,
      );

//    أحسنت.WAV
    }
    myscore += score;
  }

  MaterialColor color_level(int a) {
    if (a <= mylevel)
      return Colors.green;
    else
      return Colors.grey;
  }

  Widget mytext(int x) {
    if (x <= mylevel)
      return Text('${x + 1}',
          style: TextStyle(fontSize: 19, color: Colors.white));
    else
      return Icon(Ionicons.ios_lock);
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('التسجيل   $myscore'),
        backgroundColor: Colors.orange[800],
      ),
      body: SafeArea(
          child: Padding(
        padding: const EdgeInsets.only(top: 30),
        child: GridView.count(
          crossAxisCount: 3,
          scrollDirection: Axis.vertical,
//          Text: "sx",

          children: List.generate(12, (index) {
            return Center(
                child: IntrinsicWidth(
                    child: Column(
                        mainAxisAlignment: MainAxisAlignment.spaceEvenly,
                        children: <Widget>[
                  InkWell(
                      onTap: () {
                        if (index <= mylevel)
                          Navigator.push(
                            context,
                            MaterialPageRoute(
                                builder: (context) => test(get_question(index),
                                    get_answer(index), index)),
                          );
                      },
                      child: Container(
                          decoration: BoxDecoration(
                            color: color_level(index),
                            border: Border.all(color: Colors.black, width: 3.0),
                            borderRadius: BorderRadius.circular(10),
                          ),
                          padding: const EdgeInsets.all(16.0),
                          child: mytext(index))),
                  if (index == 10)
                    RaisedButton(
                      child: Text("الرجوع"),
                      onPressed: () {
                        setState(() {
                          Navigator.push(
                            context,
                            MaterialPageRoute(builder: (context) => MyApp()),
                          );
                        });
                      },
                    ),
                ])));
          }),
        ),
      )),
    );
  }

  List<String> get_question(int a) {
    List<List<String>> question = [
      ["الحقد", "التمادي في الظلال", "الوضوح", "تواتر", "القرب"],
      ["حليم", "المعارضة", "سل السيف", "لا يستطاع إصلاحه", "إصلاح الفاسد"],
      ["الخيبة", "المصالحة", "عطشان", "الذريعة", "انقياد الأمر"],
      ["الالتباس", "انتظم الأمر", "البعد", "الغبار", "خائف"],
      ["الكثير", "تعسّر", "اتسع", "المآب", "اتسق"],
      ["جامَلهُ", "الجَواد", "سَلَّط", "شرس", "سليط"],
      ["شاحب", "مُكتئِب", "يشتهي", "أَجَل", "الصّقيع"],
      ["أَجَلّ", "أَجَّل", "إفتقر", "الوَهَن", "هَرْوَلَ"],
      ["بَاكِر", "يلوح", "ابتكر", "تجاهل", "جاهِل"],
      ["إدّخر", "إِسْتِرَاحة", "تَسْريح", "بَاسِم", "أَبَاح"],
      ["لا يستطاع إصلاحه", "إصلاح الفاسد", "الخيبة", "المصالحة", "عطشان"],
      ["الذريعة", "انقياد الأمر", "الالتباس", "انتظم الأمر", "البعد"]
    ];

    return question[a];
  }

  List<List<String>> get_answer(int a) {
    List<List<List<String>>> answer = [
      [
        ["ضغينة", "واحنة ", "سخيمة", "السداد", "البَثّ", "التنفيد"],
        [
          "نهمك في غوايته",
          "أوضح في جهله",
          "أصر على باطله",
          "يلوح",
          "ابتكر",
          "تجاهل"
        ],
        [
          "انكشف الغطاء",
          "زال الإرتياب",
          "حصحص الحق",
          "دَجَن",
          "اشرأب إليه",
          "المتاركة"
        ],
        ["تهافت", "تدارك", "توالي", "درك الحاجة", "المجارَّة", "اطلاع"],
        [
          "الدنو",
          "الزلفى",
          "بمرأى مني و  مسمع",
          "الملاحفة",
          "يهدي هدية",
          "مُعدم"
        ]
      ],
      [
        [
          "ثابت العقل",
          "وازن الرأي",
          "ثابت الوطأة",
          "مُوسر",
          "القاصي",
          "مَذِلَ"
        ],
        ["المماكرة", "المكايدة", "المداهنة", "تطاول له", "المساورة", "ضم نشره"],
        ["شهره", "جرده", "سنه", "رقع الخرق", "المماظاة", "نيل الحاجة"],
        [
          "لا يرجى رأبه",
          "لا يرتق وهيه",
          "لا يلأم صدعه",
          "حرَس غفلته",
          " الخلة",
          "تراخى"
        ],
        ["رقع الخرق", "رتق الفتق", "جبر الوهن", "تراخى", "سنه", "الوصْله"]
      ],
      [
        ["مخنق", "محدود", "مكد", "مُعدَم", "الطفيف", "يفترص غفلته"],
        [
          "المسالمة",
          "المحاجزة",
          "المتاركة",
          "صحيحه",
          "عَطِفَ",
          "أصر على باطله"
        ],
        ["ظماّن", "هائم", "الغُلّة", "رزته", "المصارفة", "الرتق و الفتق"],
        ["المسلك", "الوسيلة", "الوصْلة", "التنقيب", "تراخى", "الثَوَل"],
        [
          "سلس المطلب",
          "سهل المرام",
          "داني الملتمس",
          "زال الإرتياب",
          "زاغ",
          "مَذِلَ"
        ]
      ],
      [
        ["اشتبه", "استبهم", "استعجم", "الحُبور", "الغنظ", "يراعي غرته"],
        ["اتسق", "استتب", "استطفّ", "تطاول له", "خَتَرَ ذمته", "تراخى"],
        ["الغارب", "القاصي", "النائي", "الإسراف", "صفقة يدي", "الوصْلة"],
        ["العجاج", "الرهج", "النّقع", "التنقص", "المسالمة", "سهل المرام"],
        ["منخوب", "مذعور", "مُرتاع", "مغوار", "رتق الفتق", "المصارفة"]
      ],
      [
        ["الجمّ", "الكثيف", "غَمْرٌ", "العشرة", "استتب", "الغيظ"],
        ["اعتاص", "التوى", "توعّر", "صفحت عنه", "الإرتداع", "صَرَمَه"],
        ["اِمْتَدَّ", "رَحُبَ", "فَسُحَ", "إِنْكَمَشَ", "تَقَلَّصَ", "طُوِيَ"],
        [
          "رُجُوع",
          "عاقِبَة ( الأَمْر )",
          "عَوْدَة",
          "المآب",
          "رَحِيلٌ",
          "إِسْتِهْلالٌ"
        ],
        [
          "إِسْتَوَى",
          "إِنْتَظَمَ",
          "إِنْسَجَم",
          "إِمْتَنَعَ",
          "تَوَقَّفَ",
          "خالَفَ"
        ]
      ],
      [
        ["تَصَنَّعَ", "تَكَلَّفَ", "تَمَلَّقَ", "خاشَنَ", "سَمِجَ", "شارَسَ"],
        ["سَخِيّ", "سَمْح", "فَيَّاض", "بَخيلٌ", "شَحِيحٌ", "ضنينٌ"],
        ["أَمَّرَ", "رَأَّسَ", "سَوَّدَ", "أَخْضَعَ", "أَذَلَّ", "أَذْعَنَ"],
        ["حادّ", "حَازِم", "خشِن", "الوَديع", "اللَّطِيف", "اللَّيِّن"],
        ["بَذِيء", "سَفِيه", "بَذِيء", "بَرِيءٌ", "طاهِرٌ", "عَفِيفٌ"]
      ],
      [
        ["أَهْيَف", "باهِت", "ضَامِر", "النَّضِر", "الزَّاهِي", "فاتِحٌ"],
        ["حَزِين", "شَاجِن", "كَئِيب", "الفَرِح", "المَسْرور", "مُبْتَهِجٌ"],
        ["أرَادَ", "إِبْتَغَى", "إِشْتَاقَ", "إِشْمَأَزَّ", "رَضِيَ", "ضَجِرَ"],
        ["إِحْتِضار", "حَتْف", "حَقًّا", "البِدَاية", "إِسْتِمرارٌ", "دَوامٌ"],
        ["زَمْهرير", "قَرّ", "بُرُودَة", "الأَجَّة", "حَرَارَةٌ", "قَيْظٌ"]
      ],
      [
        ["أَحْسَنُ", "أَرْقى", "أَسْمَى", "أَحْقَر", "أَدْنَى", "أَوْضَع"],
        [
          "أَبْطَأَ",
          "أَعَاقَ",
          "سَوَّفَ",
          "أَسْرَعَ",
          "إِسْتَعْجَلَ",
          "بَكَّرَ"
        ],
        [
          "اِحْتاجَ",
          "أَفْلَسَ",
          "أَعْدَمَ",
          "أَثْرى",
          "أَيْسَرَ",
          "إِسْتَغْنَى"
        ],
        ["إِرْتخَاء", "تَخَاذُل", "خَوَر", "حماسٌ", "حميةٌ", "قُوَّة"],
        ["أَسْرَعَ", "انطَلَقَ", "خَفَّ", "أَبْطَأَ", "أَنْسَأَ", "تَأَنَّى"],
      ],
      [
        ["بُكْرَة", "مُبَكِّر", "غَد", "الرَّائِح", "مَساءٌ", "مُتَوانٍ"],
        [
          "رُبَّمَا",
          "يُتَوَقَّع",
          "يُحْتَمَلُ",
          "تَشاءَمَ",
          "حقيقَةً",
          "مُؤَكَّدًا"
        ],
        [
          "اِبْتَدَعَ",
          "أَبْدَعَ",
          "أَحْدَثَ",
          "أَمَاتَ",
          "إِحْتَذَى",
          "إِمْتَثَلَ"
        ],
        [
          "تجاوَزَ",
          "تَسَاهَلَ",
          "تَغافَلَ",
          "أَدْرَكَ",
          "تَيَقَّظَ",
          "عَاقَبَ"
        ],
        ["أَبْلَه", "أَخْرَق", "أَرْعَنُ", "الحَليم", "العاقِل", "العارِف"],
      ],
      [
        ["خَبَّأَ", "جَمَعَ", "حَفِظَ", "أَسْرَفَ", "بَذَّرَ", "بَعْزَقَ"],
        [
          "إِسْتِجْمام",
          "إِسْتِرْخاء",
          "راحَة",
          "التَّعَب",
          "الكَلَل",
          "النَّصَب"
        ],
        [
          "إِطْلاق",
          "إِعْتاق",
          "إِفْراج",
          "التَّشَابُك",
          "إِسْتَعْبادٌ",
          "إِعْتِقَالٌ"
        ],
        ["ضَاحِك", "بَشُوش", "مُبْتَسِم", "العابِس", "العَبوس", "الباسِر"],
        ["أَتَاحَ", "أَجَازَ", "أَذَاعَ", "أَبْطَلَ", "أَسَرَّ", "حَرَمَ"],
      ],
      [
        [
          "لا يرجى رأبه",
          "لا يرتق وهيه",
          "لا يلأم صدعه",
          "حرَس غفلته",
          " الخلة",
          "تراخى"
        ],
        ["رقع الخرق", "رتق الفتق", "جبر الوهن", "تراخى", "سنه", "الوصْله"],
        ["مخنق", "محدود", "مكد", "مُعدَم", "الطفيف", "يفترص غفلته"],
        [
          "المسالمة",
          "المحاجزة",
          "المتاركة",
          "صحيحه",
          "عَطِفَ",
          "أصر على باطله"
        ],
        ["ظماّن", "هائم", "الغُلّة", "رزته", "المصارفة", "الرتق و الفتق"],
      ],
      [
        ["المسلك", "الوسيلة", "الوصْلة", "التنقيب", "تراخى", "الثَوَل"],
        [
          "سلس المطلب",
          "سهل المرام",
          "داني الملتمس",
          "زال الإرتياب",
          "زاغ",
          "مَذِلَ"
        ],
        ["اشتبه", "استبهم", "استعجم", "الحُبور", "الغنظ", "يراعي غرته"],
        ["اتسق", "استتب", "استطفّ", "تطاول له", "خَتَرَ ذمته", "تراخى"],
        ["الغارب", "القاصي", "النائي", "الإسراف", "صفقة يدي", "الوصْلة"],
      ]
    ];

    return answer[a];
  }
}
